tap "mongodb/brew"
tap "hashicorp/tap"
tap "supabase/tap"
tap "heroku/brew"
tap "jesseduffield/lazygit"
tap "charmbracelet/tap"
tap "universal-ctags/universal-ctags"
tap "mas-cli/tap"
tap "oven-sh/bun"

# Core CLI Tools (ALPHA)
brew "git"
brew "gh"
brew "git-lfs"
brew "lazygit"
brew "git-delta"
brew "eza"
brew "bat"
brew "ripgrep"
brew "fd"
brew "dust"
brew "procs"
brew "btop"
brew "gping"
brew "doggo"
brew "duf"
brew "fzf"
brew "peco"
brew "jq"
brew "yq"
brew "fx"
brew "tree"
brew "watch"
brew "htop"
brew "ncdu"
brew "tmux"
brew "screen"
brew "zoxide"
brew "direnv"
brew "tealdeer"
brew "shellcheck"
brew "shfmt"
brew "hyperfine"  # Command-line benchmarking tool
brew "glow"  # Terminal markdown renderer
brew "entr"  # Run commands when files change
brew "mkcert"  # Local HTTPS certificates
brew "ngrok"  # Secure tunnels to localhost
brew "httpie"  # HTTP client
brew "grpcurl"  # cURL for gRPC
brew "dive"  # Docker image explorer
brew "ctop"  # Container metrics
brew "neovim"
brew "rename"
brew "stow"
brew "wget"
brew "curl"
brew "gnupg"
brew "pinentry-mac"
brew "age"
brew "nmap"
brew "netcat"
brew "socat"
brew "tcpdump"
brew "kubectl"
brew "helm"
brew "k9s"
brew "kind"
brew "colima"
brew "awscli"
brew "aws-vault"
brew "google-cloud-sdk"  # Google Cloud CLI
brew "hashicorp/tap/terraform"
brew "kubectx"
brew "cmake"
brew "pkg-config"
brew "autoconf"
brew "automake"
brew "libtool"
brew "ninja"
brew "meson"
brew "make"
brew "openssl@3"
brew "libpq"
brew "sqlite"
brew "icu4c"
brew "ncurses"
brew "readline"
brew "gettext"
brew "imagemagick"
brew "ffmpeg"
brew "graphviz"
brew "pandoc"
brew "p7zip"
brew "zstd"
brew "lz4"
brew "xz"
brew "brotli"
brew "coreutils"
brew "findutils"
brew "gnu-sed"
brew "gawk"
brew "grep"
brew "gnu-tar"
brew "gzip"
brew "unar"
brew "tcl-tk@8"
brew "icu4c@77", args: ["force"]

# Programming Languages (ALPHA)
brew "python@3.10"
brew "python@3.11"
brew "python@3.12"
brew "pyenv"
brew "pipenv"
brew "poetry"
brew "uv"
brew "pipx"
brew "node@20"
brew "nvm"
brew "yarn"
brew "pnpm"
brew "deno"
brew "oven-sh/bun/bun"
brew "go"
brew "rustup-init"
brew "ruby"
brew "rbenv"
brew "openjdk" # Provides Java
brew "kotlin"
brew "scala"
brew "r"

# Development Tools & Services (BETA)
brew "postgresql@16"
brew "redis"
brew "mongodb-community@7.0"
brew "mas"

# GUI Applications (BETA)
cask "visual-studio-code"
cask "cursor"
cask "sublime-text"
cask "warp"
# cask "kitty"  # REMOVED - per requirements
# cask "iterm2"  # REMOVED - per requirements
cask "raycast"
cask "rectangle"
cask "stats"
cask "monitorcontrol"
cask "alt-tab"
cask "google-chrome"
# cask "firefox"  # REMOVED - per requirements
# cask "brave-browser"  # REMOVED - per requirements
cask "tableplus"
cask "dbeaver-community"
cask "redis-insight"
cask "postman"
cask "insomnia"
cask "figma"
cask "obsidian"
cask "notion"
cask "slack"
cask "discord"
cask "zoom"
cask "bartender"
cask "cleanmymac"
cask "1password"
cask "little-snitch"
cask "vlc"
cask "spotify"
cask "handbrake"
cask "docker"
# Optional alternative container runtime (retained alongside Docker for flexibility)
cask "orbstack"

# Fonts (BETA)
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-cascadia-code"
cask "font-source-code-pro"
cask "font-hack-nerd-font"
cask "font-sf-mono"
cask "font-sf-pro"
cask "font-inter"
cask "font-victor-mono"
cask "font-inconsolata"
